In [27]:
import pandas as pd
import numpy as np

In [28]:
df = pd.read_csv('/home/enma/Projects/Covid19/data/time_series_covid19_recovered_global.csv')
df.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,2/28/23,3/1/23,3/2/23,3/3/23,3/4/23,3/5/23,3/6/23,3/7/23,3/8/23,3/9/23
0,NaN,Afghanistan,33.93911,67.709953,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,NaN,Albania,41.15330,20.168300,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,NaN,Algeria,28.03390,1.659600,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,NaN,Andorra,42.50630,1.521800,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,NaN,Angola,-11.20270,17.873900,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 274 entries, 0 to 273
Columns: 1147 entries, Province/State to 3/9/23
dtypes: float64(2), int64(1143), object(2)
memory usage: 2.4+ MB

In [30]:
id_cols = ["Province/State", "Country/Region", "Lat", "Long"]
df_melted = df.melt(id_vars=id_cols, var_name="Date", value_name="Recovered")

In [31]:
df_melted.head()

  Province/State Country/Region       Lat       Long     Date  Recovered
0            NaN    Afghanistan  33.93911  67.709953  1/22/20          0
1            NaN        Albania  41.15330  20.168300  1/22/20          0
2            NaN        Algeria  28.03390   1.659600  1/22/20          0
3            NaN        Andorra  42.50630   1.521800  1/22/20          0
4            NaN         Angola -11.20270  17.873900  1/22/20          0

In [32]:
df_melted = df_melted.rename(columns={
    "Province/State": "Province",
    "Country/Region": "Country"
})

In [33]:
df_melted.head()

  Province      Country       Lat       Long     Date  Recovered
0      NaN  Afghanistan  33.93911  67.709953  1/22/20          0
1      NaN      Albania  41.15330  20.168300  1/22/20          0
2      NaN      Algeria  28.03390   1.659600  1/22/20          0
3      NaN      Andorra  42.50630   1.521800  1/22/20          0
4      NaN       Angola -11.20270  17.873900  1/22/20          0

In [34]:
df_melted["Date"] = pd.to_datetime(df_melted["Date"], format="%m/%d/%y")

In [35]:
df_melted.dtypes

Province             object
Country              object
Lat                 float64
Long                float64
Date         datetime64[ns]
Recovered             int64
dtype: object

In [36]:
df_melted = df_melted.drop(columns=["Lat","Long","Province"])

In [37]:
df_melted.head()

       Country       Date  Recovered
0  Afghanistan 2020-01-22          0
1      Albania 2020-01-22          0
2      Algeria 2020-01-22          0
3      Andorra 2020-01-22          0
4       Angola 2020-01-22          0

In [38]:
print(df_melted.shape)

print(df_melted.isna().sum())
print(df_melted["Country"].nunique())
print(df_melted["Date"].min(), df_melted["Date"].max())

(313182, 3)
Country      0
Date         0
Recovered    0
dtype: int64
201
2020-01-22 00:00:00 2023-03-09 00:00:00

In [39]:
df_melted.to_csv(
    "/home/enma/Projects/Covid19/data/processed/covid_confirmed_recovered.csv",
    index=False
)